app/controllers/produtos_controller.rb

SELECT "produtos".* FROM "produtos" ORDER BY "produtos"."nome" DESC
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT $1  [["LIMIT", 1]]
---
    def index
      @produtos = Produto.order(nome: :asc)
      @produto_com_desconto = Produto.order(:preco)

INSERT INTO "produtos" ("nome", "descricao", "preco", "created_at", "updated_at", "departamento_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "teste3"], ["descricao", "teste3"], ["preco", "122.0"], ["created_at", "2021-09-28 18:30:12.667812"], ["updated_at", "2021-09-28 18:30:12.667812"], ["departamento_id", 5]]
---
    def create

      @produto = Produto.new produto_params
      if @produto.save

SELECT "produtos".* FROM "produtos" WHERE (nome like 'f')
---
    def busca
      @nome = params[:nome]
      @produtos = Produto.where "nome like ?",  "%#{@nome}%"

UPDATE "produtos" SET "preco" = $1, "quantidade" = $2, "updated_at" = $3 WHERE "produtos"."id" = $4  [["preco", "90000.0"], ["quantidade", 90000], ["updated_at", "2021-09-28 17:59:30.156524"], ["id", 24]]
---
    def update

      if @produto.update produto_params